//1. Массив чисел от 5 до 10 добавить в конец другого массива

/* const arr = ['test', 23, 99];

const arr2 = arr.push(5, 6, 7, 8, 9, 10);

console.log(arr); */



//2. Дан массив чисел [4, 9, 16, 25, 36, 49]. На его основе создать массив с квадратными корнями чисел (Math.sqrt)

/* const arr = [4, 9, 16, 25, 36, 49];

const arr2 = arr.map(Math.sqrt);

console.log(arr2); */


//3. Дан массив чисел 1...20. Вычислить сумму нечетных чисел массива



//4. * Дан массив чисел 1 до 10. Удалить у него каждое нечетное значение



/* 5. * Обычным циклом создать массив строк от "user1" до "user15".
Удалить все ячейки содержащие на конце строки символы 2, 3, 4.
Пример (подчёркнутые должны быть удалены)
[ "user1", _"user2"_, _"user3"_, _"user4"_, "user5", ..., _"user12"_ ]
 */