//Циклы и массивы + вычисляемые свойства

//1. Создать массив в переменную  и после заполнить его числами последовательно от 5 до 15

/* const arr = [];

for (let i = 5; i <= 15; i++) {
  arr[`${i - 5}`] = i;
}

console.log(arr); */


//2. Создать массив и заполнить его 10ю нечетными числами

/* const arr = [];

for (let i = 1; i <= 19; i+=2) {
  arr.push(i);
}

console.log(arr); */


//3. С помощью функции конструктора User создать 10 пользователей и поместить их в массив

//4. * массив (с примитивными типами) перевести в строку с разделителем & или @

//5. * Переменную хранящей обьект преобразовать в массив






 
