//Циклы и массивы + вычисляемые свойства

//1. Создать массив в переменную  и после заполнить его числами последовательно от 5 до 15

//2. Создать массив и заполнить его 10ю нечетными числами

//3. С помощью функции конструктора User создать 10 пользователей и поместить их в массив

//4. * массив (с примитивными типами) перевести в строку с разделителем & или @

//5. * Переменную хранящей обьект преобразовать в массив






 /* 
const arr = [];
//const arr2 = arr.filter()


for (let i = 5; i <= 15; i++) {
  arr[`${i}`] = i;
}

console.log(arr.filter(i)); */