// let a = prompt ("стороны треугольника")

// let b = prompt ("стороны треугольника")

// let s = 0.5*a*a

// console.log(s)

 

// let a = prompt("стороны трапеции")

// let b = prompt ("стороны трапеции")

// let c = prompt ("стороны трапеции")

// let s = ((a+b / 2) * c)

// console.log(s)



let a = prompt ("стороны круга")

let s = 





// Создать переменные и записать в них ответ пользователя.
// из полученных переменных посчитать площадь фигуры
// вывести результат в консоль или alert

// Предусмотрите что пользователь мог ввести буквы и сделайте преобразования.

// 1. Спросить стороны треугольника и посчитать площадь
// 2. Спросить стороны трапеции и посчитать площадь
// 3. Спросить стороны круга и посчитать площадь
// 4. Спросить стороны паралеллограма и посчитать площадь

// 5. Спросить стороны цилиндра и посчитать объем
// 6. Спросить стороны сферы и посчитать объем