// 1.1) вывести в консоль числа от 1 до 10 включительно

/* for (let i = 1; i <= 10; i++) {
  console.log(i);
} */


// 1.2) * вывести в консоль числа от -1 до -10 включительно
/* 
for (let i = -1; i >= -10; i--) {
  console.log(i);
} */


// 2) посчитать результат умножения чисел от 1 до 5



// 3) вывести в консоль таблицу умножения на 7
// пример ('7 * ' + n + ' = ' + res)



// 4) посчитать сумму нечетных чисел от 1 до 15
/* 
let sum = 1;
for (let i = 1; i <= 15; i++){
  if (i % 2 == 1) sum += i;
}
console.log(sum); */


// 5.1) циклом добавить 7 звездочек в строку



// 5.2) * кол-во звездочек определяет пользователь



// 6) * 2 цикла которые добавят звездочки и "\n" в переменную и составят квадрат из звездочек



// 7) * спрашивать пользователя определенное число до тех пор пока он его не отгадает

